src/Documents/ЗаказНаряд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказНаряд</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыИЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мастера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Обязательно!</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеНеисправности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехникаКлиента</Name>
					<Comment>Что ремонтируем</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГотовности</Name>
					<Comment>Когда обещали</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>Опционально</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварыИУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварыИУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыИЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварыИУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыИЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварыИУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мастера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварыИУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЗаказНаряд/Ext/ObjectModule.bsl
// МОДУЛЬ ОБЪЕКТА ДОКУМЕНТА "ЗАКАЗНАРЯД"

Процедура ОбработкаПроведения(Отказ, Режим)
    
    // ===== ПРОВЕРКА ДАННЫХ =====
    Если Услуги.Количество() = 0 И Материалы.Количество() = 0 Тогда
        Сообщить("Ошибка: Нет ни услуг, ни материалов!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    // ===== ИНИЦИАЛИЗАЦИЯ ДВИЖЕНИЙ =====
    Движения.ОстаткиМатериалов.Записывать = Истина;
    Движения.Продажи.Записывать = Истина;
    
    // ===== 1. ОБРАБОТКА УСЛУГ =====
    Для Каждого ТекСтрокаУслуги Из Услуги Цикл
        
        // Проверка типа
        Если ТекСтрокаУслуги.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга Тогда
            Сообщить("Ошибка: В услуги добавлен не услуга - " + ТекСтрокаУслуги.Номенклатура);
            Отказ = Истина;
            Возврат;
        КонецЕсли;
        
        // Движение в регистр Продажи
        Движение = Движения.Продажи.Добавить();
        Движение.Период = Дата;
        Движение.Номенклатура = ТекСтрокаУслуги.Номенклатура;
        Движение.Клиент = Клиент;
        Движение.Мастер = Мастер;
        Движение.Количество = ТекСтрокаУслуги.Количество;
        Движение.Выручка = ТекСтрокаУслуги.Сумма;
        Движение.Стоимость = 0;
        
    КонецЦикла;
    
    // ===== 2. ОБРАБОТКА МАТЕРИАЛОВ =====
    Для Каждого ТекСтрокаМатериала Из Материалы Цикл
        
        // Проверка типа
        Если ТекСтрокаМатериала.Материал.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Материал Тогда
            Сообщить("Ошибка: В материалы добавлен не материал - " + ТекСтрокаМатериала.Материал);
            Отказ = Истина;
            Возврат;
        КонецЕсли;
        
        // Проверка склада
        Если ТекСтрокаМатериала.Склад = Неопределено Тогда
            Сообщить("Ошибка: Для материала не указан склад!");
            Отказ = Истина;
            Возврат;
        КонецЕсли;
        
        // 2.1. Движение в ОстаткиМатериалов (СПИСАНИЕ)
        Движение = Движения.ОстаткиМатериалов.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;
        Движение.Материал = ТекСтрокаМатериала.Материал;
        Движение.Склад = ТекСтрокаМатериала.Склад;
        Движение.Количество = ТекСтрокаМатериала.Количество;
        
        // 2.2. Движение в Продажи
        Движение = Движения.Продажи.Добавить();
        Движение.Период = Дата;
        Движение.Номенклатура = ТекСтрокаМатериала.Материал;
        Движение.Клиент = Клиент;
        Движение.Мастер = Мастер;
        Движение.Количество = ТекСтрокаМатериала.Количество;
        Движение.Выручка = ТекСтрокаМатериала.Сумма;
        Движение.Стоимость = ТекСтрокаМатериала.Сумма;
        
    КонецЦикла;
    
    Сообщить("Документ успешно проведен!");
    
КонецПроцедуры

// ===== ФУНКЦИЯ ДЛЯ ПОЛУЧЕНИЯ ЦЕНЫ =====

Функция ПолучитьЦенуНоменклатуры(Номенклатура, ДатаЦены)
    
    Попытка
        // Запрос к регистру сведений "Цены"
        Запрос = Новый Запрос;
        Запрос.Текст = 
            "ВЫБРАТЬ ПЕРВЫЕ 1
            |    Цены.Цена КАК Цена
            |ИЗ
            |    РегистрСведений.Цены КАК Цены
            |ГДЕ
            |    Цены.Номенклатура = &Номенклатура
            |    И Цены.Период <= &ДатаЦены
            |УПОРЯДОЧИТЬ ПО
            |    Цены.Период УБЫВ";
        
        Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
        Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены);
        
        Результат = Запрос.Выполнить();
        Если НЕ Результат.Пустой() Тогда
            Выборка = Результат.Выбрать();
            Если Выборка.Следующий() Тогда
                Возврат Выборка.Цена;
            КонецЕсли;
        КонецЕсли;
        
        // Если цены в регистре нет, пробуем поле в справочнике
        Попытка
            Возврат Номенклатура.Цена;
        Исключение
            // Если и в справочнике нет поля Цена
            Возврат 0;
        КонецПопытки;
        
    Исключение
        // В случае любой ошибки возвращаем 0
        Возврат 0;
    КонецПопытки;
    
КонецФункции

// ===== ОБРАБОТКА ПЕРЕД ЗАПИСЬЮ =====

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    // === АВТОПОДСТАНОВКА ЦЕН И РАСЧЕТ СУММ ДЛЯ УСЛУГ ===
    Для Каждого СтрокаУслуги Из Услуги Цикл
        Если СтрокаУслуги.Номенклатура <> Неопределено Тогда
            // Подстановка цены если не заполнена
            Если НЕ ЗначениеЗаполнено(СтрокаУслуги.Цена) Или СтрокаУслуги.Цена = 0 Тогда
                Цена = ПолучитьЦенуНоменклатуры(СтрокаУслуги.Номенклатура, Дата);
                Если Цена > 0 Тогда
                    СтрокаУслуги.Цена = Цена;
                Иначе
                    СтрокаУслуги.Цена = 100; // Цена по умолчанию для услуг
                КонецЕсли;
            КонецЕсли;
            
            // Расчет суммы
            СтрокаУслуги.Сумма = СтрокаУслуги.Количество * СтрокаУслуги.Цена;
        КонецЕсли;
    КонецЦикла;
    
    // === АВТОПОДСТАНОВКА ЦЕН И РАСЧЕТ СУММ ДЛЯ МАТЕРИАЛОВ ===
    Для Каждого СтрокаМатериала Из Материалы Цикл
        Если СтрокаМатериала.Материал <> Неопределено Тогда
            // Подстановка цены если не заполнена
            Если НЕ ЗначениеЗаполнено(СтрокаМатериала.Цена) Или СтрокаМатериала.Цена = 0 Тогда
                Цена = ПолучитьЦенуНоменклатуры(СтрокаМатериала.Материал, Дата);
                Если Цена > 0 Тогда
                    СтрокаМатериала.Цена = Цена;
                Иначе
                    СтрокаМатериала.Цена = 50; // Цена по умолчанию для материалов
                КонецЕсли;
            КонецЕсли;
            
            // Расчет суммы
            СтрокаМатериала.Сумма = СтрокаМатериала.Количество * СтрокаМатериала.Цена;
        КонецЕсли;
    КонецЦикла;
    
    // === РАСЧЕТ ИТОГОВОЙ СУММЫ ===
    ИтогСумма = 0;
    
    Для Каждого СтрокаУслуги Из Услуги Цикл
        ИтогСумма = ИтогСумма + СтрокаУслуги.Сумма;
    КонецЦикла;
    
    Для Каждого СтрокаМатериала Из Материалы Цикл
        ИтогСумма = ИтогСумма + СтрокаМатериала.Сумма;
    КонецЦикла;
    
    ИтоговаяСумма = ИтогСумма;
    
    // === УСТАНОВКА СТАТУСА ===
    Если Статус = Неопределено Тогда
        Статус = Перечисления.СтатусыЗаказа.Принят;
    КонецЕсли;
    
КонецПроцедуры
